Конфигурация/Documents/ЗакрытиеБухгалтерскихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗакрытиеБухгалтерскихСчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗакрываемыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗакрытияБухгалтерскихСчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыЗакрытияБухгалтерскихСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/БухПартииЦенныхБумагКПолучению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>БухПартииЦенныхБумагКПолучению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПокупки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПокупкиКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыПриПокупкеВСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаВСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаВСтоимости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаСНачалаГодаПоложительная</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупонаСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаНаБалансе</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаНаБалансеВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДисконтПремия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоценкаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректировкаЭСП</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переоценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыПриПокупкеСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФинансовыйРезультат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПервоначальногоПризнанияСНачалаГода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продажа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктивЕПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВариантыЗакрытияБухгалтерскихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыЗакрытияБухгалтерскихСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета91</Name>
					<Comment>Дт 91.9 - Кт 99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета90</Name>
					<Comment>Дт 90.9 - Кт 99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов911и912</Name>
					<Comment>Дт 91.1 - Кт 91.9, Дт 91.2 - Кт 91.9</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов901и902</Name>
					<Comment>Дт 90.1 - Кт 90.9, Дт 90.2 - Кт 90.9</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета99</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСЗакрытиеРаздела7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСПереносКорректировокНаПереоценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСПереносНачисленныхКорректировокНаПереоценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСЗакрытиеРаздела7ВОплаченнойЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета863</Name>
					<Comment>Д 86.3.3 - К 86.3.1, Д 86.3.2 - К 86.3.3 </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета79</Name>
					<Comment>используется только при расторжении договора</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ЗакрытиеБухгалтерскихСчетов/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если Не РегистрыСведений.НастройкиУчетаОбщие.ВедетсяУчетПоВиду(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.ВидУчета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + " у " + ЭтотОбъект.СчетДоверительногоУправления + " не ведется " + ЭтотОбъект.ВидУчета, ЭтотОбъект, "ВидУчета",, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УчетныйРегистр = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ЭтотОбъект.ВидУчета);
	Движения[УчетныйРегистр].Записывать = Истина;
		
	Для каждого СтрокаЗакрываемыеСчета Из ЭтотОбъект.ЗакрываемыеСчета Цикл
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("НачалоПериода",                Новый Граница(НачалоДня(ЭтотОбъект.НачалоПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("КонецПериода",                 Новый Граница(КонецДня(ЭтотОбъект.ОкончаниеПериода), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		Если СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета91 Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты911.СуммаОборотКт - БухгалтерскийУчетОбороты911.СуммаОборотДт - БухгалтерскийУчетОбороты912.СуммаОборотДт + БухгалтерскийУчетОбороты912.СуммаОборотКт КАК Сальдо91
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты911,
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты912";
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
				
			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], 0, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Если Выборка.Сальдо91 > 0 Тогда
					Проводка.СчетДт = ПланыСчетов.Основной.СальдоПрочихДоходовИРасходов;
					Проводка.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;
					Проводка.Сумма  = Выборка.Сальдо91;
				Иначе
					Проводка.СчетДт = ПланыСчетов.Основной.ПрибылиИУбытки;
					Проводка.СчетКт = ПланыСчетов.Основной.СальдоПрочихДоходовИРасходов;
					Проводка.Сумма  = -Выборка.Сальдо91;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета90 Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты901.СуммаОборотКт - БухгалтерскийУчетОбороты902.СуммаОборотДт - БухгалтерскийУчетОбороты903.СуммаОборотДт КАК Сальдо90
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты901,
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПродажиНДС),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты903,
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты902";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);

			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], 0, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Если Выборка.Сальдо90 > 0 Тогда
					Проводка.СчетДт = ПланыСчетов.Основной.ПрибыльУбытокОтПродаж;
					Проводка.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;
					Проводка.Сумма  = Выборка.Сальдо90;
				Иначе
					Проводка.СчетДт = ПланыСчетов.Основной.ПрибылиИУбытки;
					Проводка.СчетКт = ПланыСчетов.Основной.ПрибыльУбытокОтПродаж;
					Проводка.Сумма  = -Выборка.Сальдо90;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчетов911и912 Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты.Субконто1,
				|	БухгалтерскийУчетОбороты.Субконто2,
				|	БухгалтерскийУчетОбороты.Субконто3,
				|	БухгалтерскийУчетОбороты.СуммаОборотКт - БухгалтерскийУчетОбороты.СуммаОборотДт КАК СуммаОборотКт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты";
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
				
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОборотКт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеДоходы;
				Проводка.СчетКт = ПланыСчетов.Основной.СальдоПрочихДоходовИРасходов;
				
				Для НомСубк = 1 По Проводка.СчетДт.ВидыСубконто.Количество() Цикл
					Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[НомСубк - 1].ВидСубконто] = Выборка["Субконто" + НомСубк];
				КонецЦикла;				
				
			КонецЦикла;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты.Субконто1,
				|	БухгалтерскийУчетОбороты.Субконто2,
				|	БухгалтерскийУчетОбороты.Субконто3,
				|	БухгалтерскийУчетОбороты.СуммаОборотДт - БухгалтерскийУчетОбороты.СуммаОборотКт КАК СуммаОборотДт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеРасходы),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);

			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОборотДт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Проводка.СчетДт = ПланыСчетов.Основной.СальдоПрочихДоходовИРасходов;
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеРасходы;
				
				Для НомСубк = 1 По Проводка.СчетКт.ВидыСубконто.Количество() Цикл
					Проводка.СубконтоКт[Проводка.СчетКт.ВидыСубконто[НомСубк - 1].ВидСубконто] = Выборка["Субконто" + НомСубк];
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчетов901и902 Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты.Субконто1,
				|	БухгалтерскийУчетОбороты.Субконто2,
				|	БухгалтерскийУчетОбороты.Субконто3,
				|	БухгалтерскийУчетОбороты.СуммаОборотКт - БухгалтерскийУчетОбороты.СуммаОборотДт КАК СуммаОборотКт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Выручка),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);

			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОборотКт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Проводка.СчетДт = ПланыСчетов.Основной.Выручка;
				Проводка.СчетКт = ПланыСчетов.Основной.ПрибыльУбытокОтПродаж;
				
				Для НомСубк = 1 По Проводка.СчетДт.ВидыСубконто.Количество() Цикл
					Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[НомСубк - 1].ВидСубконто] = Выборка["Субконто" + НомСубк];
				КонецЦикла;				
			КонецЦикла;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты.Субконто1 КАК Субконто1,
				|	БухгалтерскийУчетОбороты.Субконто2 КАК Субконто2,
				|	БухгалтерскийУчетОбороты.Субконто3 КАК Субконто3,
				|	БухгалтерскийУчетОбороты.СуммаОборотДт - БухгалтерскийУчетОбороты.СуммаОборотКт КАК СуммаОборотДт,
				|	БухгалтерскийУчетОбороты.Счет КАК Счет
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.СебестоимостьПродажи), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПродажиНДС)),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты";
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
				
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОборотДт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПрибыльУбытокОтПродаж;
				Проводка.СчетКт = Выборка.Счет;
				
				Для НомСубк = 1 По Проводка.СчетКт.ВидыСубконто.Количество() Цикл
					Проводка.СубконтоКт[Проводка.СчетКт.ВидыСубконто[НомСубк - 1].ВидСубконто] = Выборка["Субконто" + НомСубк];
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета99 Тогда
			// определим счет, на который закрывается 99 счет
			СчетУчетаГодовогоФинасовогоРезультата = БухгалтерскийУчет.ОпределитьНастройкуУчета(
				ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, "СчетУчетаГодовогоФинасовогоРезультата");
				
			Если НЕ ЗначениеЗаполнено(СчетУчетаГодовогоФинасовогоРезультата) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан в настройках счет учета годового финансового результата",ЭтотОбъект.Ссылка,,,Отказ);             
				Возврат;
			КонецЕсли;                       
				
			Движения[УчетныйРегистр].Записать();
			Движения[УчетныйРегистр].Записывать = Истина;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОстатки.Субконто1,
				|	БухгалтерскийУчетОстатки.СуммаОстатокДт,
				|	БухгалтерскийУчетОстатки.СуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&КонецПериода,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрибылиИУбытки),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
			
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОстатокДт + Выборка.СуммаОстатокКт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Если Выборка.СуммаОстатокДт > 0 Тогда
					Проводка.СчетДт = СчетУчетаГодовогоФинасовогоРезультата;
					Проводка.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;
				Иначе
					Проводка.СчетДт = ПланыСчетов.Основной.ПрибылиИУбытки;
					Проводка.СчетКт = СчетУчетаГодовогоФинасовогоРезультата;
				КонецЕсли;
				
			КонецЦикла;
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСЗакрытиеРаздела7
			И ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			// определим счет, на который закрывается 99 счет
			
			НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(
				ЭтотОбъект.ОкончаниеПериода,
				ЭтотОбъект.Организация,
				ЭтотОбъект.СчетДоверительногоУправления);	
			
			
			Движения[УчетныйРегистр].Записывать = Истина;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕдиныйБухгалтерскийУчетОстатки.Счет,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто3,
				|	ЕдиныйБухгалтерскийУчетОстатки.Организация,
				|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления,
				|	ЕдиныйБухгалтерскийУчетОстатки.Валюта,
				|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет,
				|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт,
				|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт,
				|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(&КонецПериода, ПОДСТРОКА(Счет.Код, 1, 1) = ""7"", , СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки";

			
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				
				СуммаОстаток = ?(Выборка.СуммаОстаток > 0, Выборка.СуммаОстаток, - Выборка.СуммаОстаток);
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], СуммаОстаток, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				СчетУчета = Выборка.Счет;
				Если Выборка.СуммаОстаток > 0 Тогда
					Сторона = "Кт";
					Сторона479 = "Дт";
				Иначе
					Сторона = "Дт";
					Сторона479 = "Кт";
				КонецЕсли;
				Проводка["Счет"+Сторона] = СчетУчета;
				Проводка["ЛицевойСчет"+Сторона] = Выборка.ЛицевойСчет;
				Проводка["ДополнительнаяАналитика"+Сторона] = Выборка.ДополнительнаяАналитика;
				
				Для Инд = 0 По СчетУчета.ВидыСубконто.Количество() - 1 Цикл
					ВидСубконто = СчетУчета.ВидыСубконто[Инд].ВидСубконто;
					Проводка["Субконто"+Сторона][ВидСубконто] = Выборка["Субконто"+(Инд+1)]
				КонецЦикла;
				Если СчетУчета.Валютный Тогда
					Проводка["Валюта"+Сторона] = Выборка.Валюта;
					Проводка["ВалютнаяСумма"+Сторона] = Выборка["ВалютнаяСуммаОстаток"+Сторона];
				КонецЕсли;
				
				Проводка["Счет"+Сторона479] = ПланыСчетов.Единый.АктивыВДУ03;
				Проводка["Субконто"+Сторона479].Договоры = СчетДоверительногоУправления;
				
				Если НастройкиУчета.ОтражатьПартииНаЛицевыхСчетах Тогда
					
					Проводка.Партия = Выборка.ЛицевойСчет.Партия;
					Проводка.СтрокаПартии = Выборка.ЛицевойСчет.СтрокаПартии;
				
				КонецЕсли;
				
			КонецЦикла;
			
			Движения.БухПартииЦенныхБумаг.Записывать = Истина;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
				|	&Дата КАК Период,
				|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
				|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	БухПартииЦенныхБумагОстатки.ВидУчета КАК ВидУчета,
				|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
				|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
				|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
				|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода,
				|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГода,
				|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГода,
				|	ВЫБОР
				|		КОГДА БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажи)
				|			ТОГДА 0
				|		ИНАЧЕ БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток
				|	КОНЕЦ КАК ПереоценкаСНачалаГода,
				|	ВЫБОР
				|		КОГДА БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажи)
				|			ТОГДА 0
				|		ИНАЧЕ БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаПоложительнаяОстаток
				|	КОНЕЦ КАК ПереоценкаСНачалаГодаПоложительная,
				|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеСНачалаГодаОстаток КАК РасходыПриПокупкеСНачалаГода,
				|	БухПартииЦенныхБумагОстатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГода
//				|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПартий.Закрытие7гоРаздела) КАК ВидДвиженияПартий
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки"; 
				
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Движения.БухПартииЦенныхБумаг.Добавить(), Выборка);
			КонецЦикла; 
			
			Движения.БухПартииЦенныхБумагПроданныеВРепо.Записывать = Истина;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
				|	&Дата КАК Период,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Организация КАК Организация,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ВидУчета КАК ВидУчета,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Рынок КАК Рынок,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.Партия КАК Партия,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГода,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГода,
				|	ВЫБОР
				|		КОГДА БухПартииЦенныхБумагПроданныеВРепоОстатки.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажи)
				|			ТОГДА 0
				|		ИНАЧЕ БухПартииЦенныхБумагПроданныеВРепоОстатки.ПереоценкаСНачалаГодаОстаток
				|	КОНЕЦ КАК ПереоценкаСНачалаГода,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РасходыПриПокупкеСНачалаГодаОстаток КАК РасходыПриПокупкеСНачалаГода,
				|	БухПартииЦенныхБумагПроданныеВРепоОстатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГода
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумагПроданныеВРепо.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагПроданныеВРепоОстатки"; 
				
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Движения.БухПартииЦенныхБумагПроданныеВРепо.Добавить(), Выборка);
			КонецЦикла; 
			
			Движения.БухПартииЦенныхБумагКПолучению.Записывать = Истина;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
				|	&Дата КАК Период,
				|	БухПартииЦенныхБумагКПолучениюОстатки.Организация КАК Организация,
				|	БухПартииЦенныхБумагКПолучениюОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	БухПартииЦенныхБумагКПолучениюОстатки.ВидУчета КАК ВидУчета,
				|	БухПартииЦенныхБумагКПолучениюОстатки.Рынок КАК Рынок,
				|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
				|	БухПартииЦенныхБумагКПолучениюОстатки.Партия КАК Партия,
				|	БухПартииЦенныхБумагКПолучениюОстатки.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииЦенныхБумагКПолучениюОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГода,
				|	ВЫБОР
				|		КОГДА БухПартииЦенныхБумагКПолучениюОстатки.УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажи)
				|			ТОГДА 0
				|		ИНАЧЕ БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаСНачалаГодаОстаток
				|	КОНЕЦ КАК ПереоценкаСНачалаГода
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагКПолучениюОстатки"; 
				
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Движения.БухПартииЦенныхБумагКПолучению.Добавить(), Выборка);
			КонецЦикла; 
			
			Движения.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС.Записывать = Истина;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
				|	&Дата КАК Период,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.Организация КАК Организация,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.Продажа КАК Продажа,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.ДисконтПремияОстаток КАК ДисконтПремия,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупона,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСП,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.ПереоценкаОстаток КАК Переоценка,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.РасходыПриПокупкеСНачалаГодаОстаток КАК РасходыПриПокупкеСНачалаГода,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.ФинансовыйРезультатОстаток КАК ФинансовыйРезультат,
				|	НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки.РазницаПервоначальногоПризнанияСНачалаГодаОстаток КАК РазницаПервоначальногоПризнанияСНачалаГода
				|ИЗ
				|	РегистрНакопления.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПСОстатки"; 
				
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Движения.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС.Добавить(), Выборка);
			КонецЦикла; 
			
			Движения.БухПартииСрочныхКонтрактов.Записывать = Истина;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
				|	&Дата КАК Период,
				|	БухПартииСрочныхКонтрактовОстатки.Организация КАК Организация,
				|	БухПартииСрочныхКонтрактовОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	БухПартииСрочныхКонтрактовОстатки.ВидУчета КАК ВидУчета,
				|	БухПартииСрочныхКонтрактовОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
				|	БухПартииСрочныхКонтрактовОстатки.Партия КАК Партия,
				|	БухПартииСрочныхКонтрактовОстатки.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииСрочныхКонтрактовОстатки.ВидСделки КАК ВидСделки,
				|	БухПартииСрочныхКонтрактовОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	БухПартииСрочныхКонтрактовОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГода
				|ИЗ
				|	РегистрНакопления.БухПартииСрочныхКонтрактов.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииСрочныхКонтрактовОстатки"; 
				
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Движения.БухПартииСрочныхКонтрактов.Добавить(), Выборка);
			КонецЦикла; 
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСЗакрытиеРаздела7ВОплаченнойЧасти
			И ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вариант ЕПС закрытие раздела 7 в оплаченной части не реализовано!", ЭтотОбъект, "ВидУчета",, Отказ);
			Возврат;
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСПереносКорректировокНаПереоценки
			И ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
				
			Движения[УчетныйРегистр].Записывать = Истина;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	УчетныеАктивыЕПС.СчетУчетаКорректировокА КАК СчетУчетаКорректировок,
				|	УчетныеАктивыЕПС.СчетУчетаПереоценкиА КАК СчетУчетаПереоценки
				|ПОМЕСТИТЬ СчетаУчетаКорректировокИПереоценок
				|ИЗ
				|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
				|ГДЕ
				|	УчетныеАктивыЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	УчетныеАктивыЕПС.СчетУчетаКорректировокП,
				|	УчетныеАктивыЕПС.СчетУчетаПереоценкиП
				|ИЗ
				|	Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
				|ГДЕ
				|	УчетныеАктивыЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК Счет,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК Субконто1,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК Субконто2,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто3 КАК Субконто3,
				|	ЕдиныйБухгалтерскийУчетОстатки.Организация КАК Организация,
				|	ЕдиныйБухгалтерскийУчетОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	ЕдиныйБухгалтерскийУчетОстатки.Валюта КАК Валюта,
				|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет КАК ЛицевойСчет,
				|	ЕдиныйБухгалтерскийУчетОстатки.ЛицевойСчет.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
				|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
				|	ЕдиныйБухгалтерскийУчетОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
				|	СчетаУчетаКорректировокИПереоценок.СчетУчетаПереоценки КАК СчетУчетаПереоценки
				|ИЗ
				|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
				|			&КонецПериода,
				|			Счет В
				|				(ВЫБРАТЬ
				|					СчетаУчетаКорректировокИПереоценок.СчетУчетаКорректировок
				|				ИЗ
				|					СчетаУчетаКорректировокИПереоценок),
				|			,
				|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаУчетаКорректировокИПереоценок КАК СчетаУчетаКорректировокИПереоценок
				|		ПО (СчетаУчетаКорректировокИПереоценок.СчетУчетаКорректировок = ЕдиныйБухгалтерскийУчетОстатки.Счет)";

			
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				
				СуммаОстаток = ?(Выборка.СуммаОстаток > 0, Выборка.СуммаОстаток, - Выборка.СуммаОстаток);
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], СуммаОстаток, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				СчетУчетаКорректировки = Выборка.Счет;
				СчетУчетаПереоценки = Выборка.СчетУчетаПереоценки;
				
				Если Выборка.СуммаОстаток > 0 Тогда
					СторонаКорректировки = "Кт";
					СторонаПереоценки = "Дт";
				Иначе
					СторонаКорректировки = "Дт";
					СторонаПереоценки = "Кт";
				КонецЕсли;
				Проводка["Счет" + СторонаКорректировки] = СчетУчетаКорректировки;
				Проводка["ЛицевойСчет" + СторонаКорректировки] = Выборка.ЛицевойСчет;
				
				Проводка["Счет" + СторонаПереоценки] = СчетУчетаПереоценки;
				Проводка["ДополнительнаяАналитика" + СторонаПереоценки] = Справочники.ДополнительныеАналитикиЛицевыхСчетов.ПереоценкаТелаЦеннойБумаги;
				
				Для Инд = 0 По СчетУчетаКорректировки.ВидыСубконто.Количество() - 1 Цикл
					ВидСубконто = СчетУчетаКорректировки.ВидыСубконто[Инд].ВидСубконто;
					Проводка["Субконто" + СторонаКорректировки][ВидСубконто] = Выборка["Субконто" + (Инд + 1)];
					Проводка["Субконто" + СторонаПереоценки][ВидСубконто] = Выборка["Субконто" + (Инд + 1)];
				КонецЦикла;
				
				Проводка["Валюта" + СторонаКорректировки] = Выборка.Валюта;
				Проводка["ВалютнаяСумма" + СторонаКорректировки] = Выборка["ВалютнаяСуммаОстаток" + СторонаПереоценки];
				
				Проводка["Валюта" + СторонаПереоценки] = Выборка.Валюта;
				Проводка["ВалютнаяСумма" + СторонаПереоценки] = Выборка["ВалютнаяСуммаОстаток" + СторонаПереоценки];
				
			КонецЦикла;
			
			БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
			
			Движения.БухПартииЦенныхБумаг.Записывать = Истина;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
				|	&Дата КАК Период,
				|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
				|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	БухПартииЦенныхБумагОстатки.ВидУчета КАК ВидУчета,
				|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
				|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
				|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
				|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	-БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСП,
				|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК Переоценка,
				|	-БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток КАК КорректировкаЭСПВВалютеУчета,
				|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПВВалютеУчетаОстаток КАК ПереоценкаВВалютеУчета
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
				|				И УчетныйАктивЕПС.Родитель = ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПрибыльУбыток)) КАК БухПартииЦенныхБумагОстатки"; 
				
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Движения.БухПартииЦенныхБумаг.Добавить(), Выборка);
			КонецЦикла; 
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСПереносНачисленныхКорректировокНаПереоценки
			И ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет Тогда
			
				
			Движения[УчетныйРегистр].Записывать = Истина;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕдиныйБухгалтерскийУчетОстатки.Счет КАК СчетКорректировки,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК АналитикаКорректировки,
				|	ЕдиныйБухгалтерскийУчетОстатки.Субконто2 КАК ЦеннаяБумага,
				|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстаток КАК СуммаОстаток,
				|	ЕСТЬNULL(УчетныеАктивыЕПС.СчетУчетаДоходовОтОпераций, УчетныеАктивыЕПС1.СчетУчетаРасходовОтОпераций) КАК СчетПереоценки,
				|	ЕСТЬNULL(УчетныеАктивыЕПС.АналитикаДоходовОтОпераций, УчетныеАктивыЕПС1.АналитикаРасходовОтОпераций) КАК АналитикаПереоценки
				|ИЗ
				|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
				|			&КонецПериода,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы05)
				|				ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.ПроцентныеДоходы06),
				|			,
				|			СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
				|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = УчетныеАктивыЕПС.АналитикаДоходовОтКорректировки
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС1
				|		ПО ЕдиныйБухгалтерскийУчетОстатки.Субконто1 = УчетныеАктивыЕПС1.АналитикаРасходовОтКорректировки";

			
			ВидСубконтоГФУ = ПланыВидовХарактеристик.ВидыСубконто.ГруппыФинансовогоУчетаДоходовРасходов;
			ВидСубконтоЦБ = ПланыВидовХарактеристик.ВидыСубконто.ЦенныеБумаги;
			
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				
				СуммаОстаток = ?(Выборка.СуммаОстаток > 0, Выборка.СуммаОстаток, - Выборка.СуммаОстаток);
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], СуммаОстаток, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Если Выборка.СуммаОстаток > 0 Тогда
					СторонаКорректировки = "Кт";
					СторонаПереоценки = "Дт";
				Иначе
					СторонаКорректировки = "Дт";
					СторонаПереоценки = "Кт";
				КонецЕсли;
				
				Проводка["Счет" + СторонаКорректировки] = Выборка.СчетКорректировки;
				
				Проводка["Субконто" + СторонаКорректировки][ВидСубконтоГФУ] = Выборка.АналитикаКорректировки;
				Проводка["Субконто" + СторонаКорректировки][ВидСубконтоЦБ] = Выборка.ЦеннаяБумага;
				
				
				Проводка["Счет" + СторонаПереоценки] = Выборка.СчетПереоценки;
				
				Проводка["Субконто" + СторонаПереоценки][ВидСубконтоГФУ] = Выборка.АналитикаПереоценки;
				Проводка["Субконто" + СторонаПереоценки][ВидСубконтоЦБ] = Выборка.ЦеннаяБумага;
				
			КонецЦикла;
			
			
			Движения.БухПартииЦенныхБумаг.Записывать = Истина;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
				|	&Дата КАК Период,
				|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
				|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
				|	БухПартииЦенныхБумагОстатки.ВидУчета КАК ВидУчета,
				|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
				|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
				|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
				|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
				|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
				|	-БухПартииЦенныхБумагОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГода,
				|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК ПереоценкаСНачалаГода
				|ИЗ
				|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
				|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки"; 
				
			Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Движения.БухПартииЦенныхБумаг.Добавить(), Выборка);
			КонецЦикла; 
			
		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета863	Тогда
			
			Движения[УчетныйРегистр].Записать();
			Движения[УчетныйРегистр].Записывать = Истина;                 

			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты.Субконто1 КАК Субконто1,
				|	БухгалтерскийУчетОбороты.СуммаОборотКт - БухгалтерскийУчетОбороты.СуммаОборотДт КАК СуммаОборот
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ЦелевоеФинансированиеПФРПереданноеВОтчетномГоду),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);

			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОборот, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Проводка.СчетДт = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРПереданноеВОтчетномГоду;
				Проводка.СчетКт = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРНаНачалоОтчетногоГода;
				
				Для НомСубк = 1 По Проводка.СчетДт.ВидыСубконто.Количество() Цикл
					Проводка.СубконтоДт[Проводка.СчетДт.ВидыСубконто[НомСубк - 1].ВидСубконто] = Выборка["Субконто" + НомСубк];
				КонецЦикла;				
				
			КонецЦикла;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОбороты.Субконто1 КАК Субконто1,
				|	БухгалтерскийУчетОбороты.СуммаОборотДт - БухгалтерскийУчетОбороты.СуммаОборотКт КАК СуммаОборот
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
				|			&НачалоПериода,
				|			&КонецПериода,
				|			Период,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ЦелевоеФинансированиеПФРВозврат),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
				|			,
				|			) КАК БухгалтерскийУчетОбороты";
				
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
				
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОборот, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
				
				Проводка.СчетДт = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРНаНачалоОтчетногоГода;
				Проводка.СчетКт = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРВозврат;
				
				Для НомСубк = 1 По Проводка.СчетКт.ВидыСубконто.Количество() Цикл
					Проводка.СубконтоКт[Проводка.СчетКт.ВидыСубконто[НомСубк - 1].ВидСубконто] = Выборка["Субконто" + НомСубк];
				КонецЦикла;
						
			КонецЦикла;			
			
			СчетУчетаГодовогоФинасовогоРезультата = БухгалтерскийУчет.ОпределитьНастройкуУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления, "СчетУчетаГодовогоФинасовогоРезультата");
			
			Если НЕ ЗначениеЗаполнено(СчетУчетаГодовогоФинасовогоРезультата) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан в настройках счет учета годового финансового результата",ЭтотОбъект.Ссылка,,,Отказ);             
				Возврат;
			КонецЕсли;                       
			
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОбороты.СуммаОборотКт - БухгалтерскийУчетОбороты.СуммаОборотДт КАК СуммаОборот
			|ИЗ
			|	РегистрБухгалтерии.БухгалтерскийУчет.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Период,
			|			Счет = &СчетУчетаГодовогоФинасовогоРезультата,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления,
			|			,
			|			) КАК БухгалтерскийУчетОбороты";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
			Запрос.УстановитьПараметр("СчетУчетаГодовогоФинасовогоРезультата", СчетУчетаГодовогоФинасовогоРезультата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.СуммаОборот > 0 Тогда  
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОборот, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);                                                           
					Проводка.СчетДт = СчетУчетаГодовогоФинасовогоРезультата;
					Проводка.СчетКт = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРНаНачалоОтчетногоГода;
				ИначеЕсли Выборка.СуммаОборот < 0 Тогда   
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], -Выборка.СуммаОборот, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);                                                           
					Проводка.СчетДт = ПланыСчетов.Основной.ЦелевоеФинансированиеПФРНаНачалоОтчетногоГода;                                                                                                                                                            
					Проводка.СчетКт = СчетУчетаГодовогоФинасовогоРезультата;
				КонецЕсли;       
			КонецЦикла;
			
 		ИначеЕсли СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов = Перечисления.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета79
			И ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления.ДатаРасторжения) 
			И ЭтотОбъект.СчетДоверительногоУправления.ДатаРасторжения <= НачалоДня(ЭтотОбъект.Дата) Тогда
			
			Движения[УчетныйРегистр].Записать();
			Движения[УчетныйРегистр].Записывать = Истина;  
									
			//проверяем счет 79.4 		
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОстатки.Счет КАК Счет,
				|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
				|	БухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&КонецПериода,
				|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрибыльУбытокДУ))
				|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.ЧастьПенсионныхВзносовДляОбеспеченияИОУД)),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
	
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				
				Если Выборка.СуммаОстатокКт > 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОстатокКт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
					
					Проводка.СчетДт = Выборка.Счет;
					Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоДоговоруДоверительногоУправленияИмуществом;
				ИначеЕсли Выборка.СуммаОстатокДт > 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОстатокДт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
					
					Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоДоговоруДоверительногоУправленияИмуществом;
					Проводка.СчетКт = Выборка.Счет;
				КонецЕсли;					
			КонецЦикла;			

			// на счете 84.5 может быть остаток. Такой же остаток должен быть на 79.3. 
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БухгалтерскийУчетОстатки.Счет КАК Счет,
				|	БухгалтерскийУчетОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
				|	БухгалтерскийУчетОстатки.СуммаОстатокКт КАК СуммаОстатокКт
				|ИЗ
				|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
				|			&КонецПериода,
				|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НераспределеннаяПрибыльИспользованная),
				|			,
				|			Организация = &Организация
				|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
	
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл
				
				Если Выборка.СуммаОстатокКт > 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОстатокКт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
					
					Проводка.СчетДт = Выборка.Счет;
					Проводка.СчетКт = ПланыСчетов.Основной.РасчетыПоДоговоруДоверительногоУправленияИмуществом;
				ИначеЕсли Выборка.СуммаОстатокДт > 0 Тогда
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[УчетныйРегистр], Выборка.СуммаОстатокДт, СтрокаЗакрываемыеСчета.ВариантЗакрытияБухгалтерскихСчетов);
					
					Проводка.СчетДт = ПланыСчетов.Основной.РасчетыПоДоговоруДоверительногоУправленияИмуществом;
					Проводка.СчетКт = Выборка.Счет;
				КонецЕсли;					
			КонецЦикла;			
				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
